{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "ask_policy",
    "1": "book_flight",
    "2": "book_trip",
    "3": "cancel_flight",
    "4": "cancel_trip",
    "5": "change_flight",
    "6": "change_seat",
    "7": "change_trip",
    "8": "check_arrival_time",
    "9": "check_departure_time",
    "10": "check_flight_offers",
    "11": "check_flight_prices",
    "12": "check_flight_reservation",
    "13": "check_flight_status",
    "14": "check_in",
    "15": "check_trip_details",
    "16": "check_trip_offers",
    "17": "check_trip_plan",
    "18": "check_trip_prices",
    "19": "choose_seat",
    "20": "end_conversation",
    "21": "get_boarding_pass",
    "22": "get_refund",
    "23": "greeting",
    "24": "human_agent",
    "25": "inform",
    "26": "irrelevant",
    "27": "print_boarding_pass",
    "28": "purchase_flight_insurance",
    "29": "purchase_trip_insurance",
    "30": "search_flight",
    "31": "search_trip"
  },
  "initializer_range": 0.02,
  "label2id": {
    "ask_policy": 0,
    "book_flight": 1,
    "book_trip": 2,
    "cancel_flight": 3,
    "cancel_trip": 4,
    "change_flight": 5,
    "change_seat": 6,
    "change_trip": 7,
    "check_arrival_time": 8,
    "check_departure_time": 9,
    "check_flight_offers": 10,
    "check_flight_prices": 11,
    "check_flight_reservation": 12,
    "check_flight_status": 13,
    "check_in": 14,
    "check_trip_details": 15,
    "check_trip_offers": 16,
    "check_trip_plan": 17,
    "check_trip_prices": 18,
    "choose_seat": 19,
    "end_conversation": 20,
    "get_boarding_pass": 21,
    "get_refund": 22,
    "greeting": 23,
    "human_agent": 24,
    "inform": 25,
    "irrelevant": 26,
    "print_boarding_pass": 27,
    "purchase_flight_insurance": 28,
    "purchase_trip_insurance": 29,
    "search_flight": 30,
    "search_trip": 31
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "multi_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
